# 27. Удалить элемент
# Легко
# Темы
# значок премиум-замка
# Компании
# Подсказка
# Дан целочисленный массив nums и целое число val. Удалите все вхождения val в nums на месте. Порядок элементов может измениться. Затем верните количество элементов в nums, которые не равны val.

# Чтобы количество элементов в nums, которые не равны val, было равно k, вам нужно сделать следующее:

# Измените массив nums таким образом, чтобы первые k элементов nums содержали элементы, не равные val. Остальные элементы nums не важны, как и размер nums.
# Верните k.
# Пользовательский судья:

# Судья проверит ваше решение с помощью следующего кода:

# int[] nums = [...]; // Исходный массив
# int val = ...; // Значение, которое нужно удалить
# int[] expectedNums = [...]; // Ожидаемый ответ правильной длины. 
#  // Массив отсортирован, в нем нет значений, равных val. 

# int k = removeElement(nums, val); // Вызывает вашу реализацию

# assert k == expectedNums.length;
# sort(nums, 0, k); // Сортируем первые k элементов массива nums
# for (int i = 0; i < actualLength; i++) {
#  assert nums[i] == expectedNums[i];
# }
# Если все утверждения верны, ваше решение будет принято.

 

# Пример 1:

# Входные данные: nums = [3,2,2,3], val = 3
# Выходные данные: 2, nums = [2,2,_,_]
# Пояснение: Ваша функция должна вернуть k = 2, при этом первые два элемента массива nums должны быть равны 2. 
#  Не имеет значения, что вы оставите после возвращенного значения k (поэтому там стоят подчеркивания).
# Пример 2:

# Входные данные: nums = [0,1,2,2,3,0,4,2], val = 2
# Выходные данные: 5, nums = [0,1,4,0,3,_,_,_]
# Пояснение: Ваша функция должна вернуть k = 5, при этом первые пять элементов массива nums должны содержать 0, 0, 1, 3 и 4. 
# Обратите внимание, что пять элементов могут быть возвращены в любом порядке.
# Не имеет значения, что вы оставляете после возвращенного значения k (поэтому используются символы подчеркивания).


class Solution:
    def removeElement(self, nums: List[int], val: int) -> int:
        write_index = 0
        for read_index in range(len(nums)):
            if nums[read_index] != val:
                nums[write_index] = nums[read_index]
                write_index += 1
        return write_index