# 66. Плюс один
# Легко
# Темы
# значок премиум-замка
# Компании
# Вам дано большое целое число, представленное в виде массива целых чисел digits, где каждый digits[i] — это ith-я цифра целого числа. Цифры расположены в порядке убывания значимости слева направо. Большое целое число не содержит ведущих 0'.

# Увеличьте большое целое число на единицу и верните полученный массив цифр.

 

# Пример 1:

# Входные данные: digits = [1,2,3]
# Выходные данные: [1,2,4]
# Пояснение: Массив представляет собой число 123.
#  Прибавим единицу: 123 + 1 = 124.
#  Таким образом, результат должен быть таким: [1,2,4].
# Пример 2:

# Входные данные: digits = [4,3,2,1]
# Выходные данные: [4,3,2,2]
# Пояснение: Массив представляет собой число 4321.
#  Прибавив единицу, мы получим 4321 + 1 = 4322.
#  Таким образом, результат должен быть таким: [4,3,2,2].
# Пример 3:

# Входные данные: digits = [9]
# Выходные данные: [1,0]
# Пояснение: Массив представляет собой число 9.
#  При увеличении на единицу получается 9 + 1 = 10.
#  Таким образом, результат должен быть таким: [1,0].
 

# Ограничения:

# 1 <= digits.length <= 100
# 0 <= digits[i] <= 9
# digits не содержит начальных 0 и апострофов.

class Solution:
    def plusOne(self, digits: List[int]) -> List[int]:
        for i in range(len(digits) - 1, -1, -1):
            if digits[i] < 9:
                digits[i] += 1
                return digits
            digits[i] = 0
        return [1] + digits